/*
 * bsp_timer.c
 *
 *  Created on: Mar 13, 2025
 *      Author: compro
 */
#include "bsp.h"

/* Õâ2¸öÈ«¾Ö±äÁ¿×ªÓÃÓÚ bsp_DelayMS() º¯Êý */
static volatile uint32_t s_uiDelayCount = 0;
static volatile uint8_t s_ucTimeOutFlag = 0;

/* ¶¨ÓÚÈí¼þ¶¨Ê±Æ÷½á¹¹Ìå±äÁ¿ */
static SOFT_TMR s_tTmr[TMR_COUNT];

/*
	È«¾ÖÔËÐÐÊ±¼ä£¬µ¥Î»1ms
	×î³¤¿ÉÒÔ±íÊ¾ 24.85Ìì£¬Èç¹ûÄãµÄ²úÆ·Á¬ÐøÔËÐÐÊ±¼ä³¬¹ýÕâ¸öÊý£¬Ôò±ØÐë¿¼ÂÇÒç³öÎÊÌâ
*/
__IO int32_t g_iRunTime = 0;

static void bsp_SoftTimerDec(SOFT_TMR *_tmr);

/*
*********************************************************************************************************
*	º¯ Êý Ãû: bsp_InitTimer
*	¹¦ÄÜËµÃ÷: ÅäÖÃsystickÖÐ¶Ï£¬²¢³õÊ¼»¯Èí¼þ¶¨Ê±Æ÷±äÁ¿
*	ÐÎ    ²Î:  ÎÞ
*	·µ »Ø Öµ: ÎÞ
*********************************************************************************************************
*/
void bsp_InitTimer(void)
{
	uint8_t i;

	/* ÇåÁãËùÓÐµÄÈí¼þ¶¨Ê±Æ÷ */
	for (i = 0; i < TMR_COUNT; i++)
	{
		s_tTmr[i].Count = 0;
		s_tTmr[i].PreLoad = 0;
		s_tTmr[i].Flag = 0;
		s_tTmr[i].Mode = TMR_ONCE_MODE;	/* È±Ê¡ÊÇ1´ÎÐÔ¹¤×÷Ä£Ê½ */
	}

	/*
		ÅäÖÃsysticÖÐ¶ÏÖÜÆÚÎª1ms£¬²¢Æô¶¯systickÖÐ¶Ï¡£

    	SystemCoreClock ÊÇ¹Ì¼þÖÐ¶¨ÒåµÄÏµÍ³ÄÚºËÊ±ÖÓ£¬¶ÔÓÚSTM32F4XX,Ò»°ãÎª 168MHz

    	SysTick_Config() º¯ÊýµÄÐÎ²Î±íÊ¾ÄÚºËÊ±ÖÓ¶àÉÙ¸öÖÜÆÚºó´¥·¢Ò»´ÎSystick¶¨Ê±ÖÐ¶Ï.
	    	-- SystemCoreClock / 1000  ±íÊ¾¶¨Ê±ÆµÂÊÎª 1000Hz£¬ Ò²¾ÍÊÇ¶¨Ê±ÖÜÆÚÎª  1ms
	    	-- SystemCoreClock / 500   ±íÊ¾¶¨Ê±ÆµÂÊÎª 500Hz£¬  Ò²¾ÍÊÇ¶¨Ê±ÖÜÆÚÎª  2ms
	    	-- SystemCoreClock / 2000  ±íÊ¾¶¨Ê±ÆµÂÊÎª 2000Hz£¬ Ò²¾ÍÊÇ¶¨Ê±ÖÜÆÚÎª  500us

    	¶ÔÓÚ³£¹æµÄÓ¦ÓÃ£¬ÎÒÃÇÒ»°ãÈ¡¶¨Ê±ÖÜÆÚ1ms¡£¶ÔÓÚµÍËÙCPU»òÕßµÍ¹¦ºÄÓ¦ÓÃ£¬¿ÉÒÔÉèÖÃ¶¨Ê±ÖÜÆÚÎª 10ms
    */
	SysTick_Config(SystemCoreClock / 1000);
}

/*
*********************************************************************************************************
*	º¯ Êý Ãû: SysTick_ISR
*	¹¦ÄÜËµÃ÷: SysTickÖÐ¶Ï·þÎñ³ÌÐò£¬Ã¿¸ô1ms½øÈë1´Î
*	ÐÎ    ²Î:  ÎÞ
*	·µ »Ø Öµ: ÎÞ
*********************************************************************************************************
*/
extern void bsp_RunPer1ms(void);
extern void bsp_RunPer10ms(void);
void SysTick_ISR(void)
{
	static uint8_t s_count = 0;
	uint8_t i;

	/* Ã¿¸ô1ms½øÀ´1´Î £¨½öÓÃÓÚ bsp_DelayMS£© */
	if (s_uiDelayCount > 0)
	{
		if (--s_uiDelayCount == 0)
		{
			s_ucTimeOutFlag = 1;
		}
	}

	/* Ã¿¸ô1ms£¬¶ÔÈí¼þ¶¨Ê±Æ÷µÄ¼ÆÊýÆ÷½øÐÐ¼õÒ»²Ù×÷ */
	for (i = 0; i < TMR_COUNT; i++)
	{
		bsp_SoftTimerDec(&s_tTmr[i]);
	}

	/* È«¾ÖÔËÐÐÊ±¼äÃ¿1msÔö1 */
	g_iRunTime++;
	if (g_iRunTime == 0x7FFFFFFF)	/* Õâ¸ö±äÁ¿ÊÇ int32_t ÀàÐÍ£¬×î´óÊýÎª 0x7FFFFFFF */
	{
		g_iRunTime = 0;
	}

	bsp_RunPer1ms();		/* Ã¿¸ô1msµ÷ÓÃÒ»´Î´Ëº¯Êý£¬´Ëº¯ÊýÔÚ bsp.c */

	if (++s_count >= 10)
	{
		s_count = 0;

		//bsp_RunPer10ms();	/* Ã¿¸ô10msµ÷ÓÃÒ»´Î´Ëº¯Êý£¬´Ëº¯ÊýÔÚ bsp.c */
	}
}

/*
*********************************************************************************************************
*	º¯ Êý Ãû: bsp_SoftTimerDec
*	¹¦ÄÜËµÃ÷: Ã¿¸ô1ms¶ÔËùÓÐ¶¨Ê±Æ÷±äÁ¿¼õ1¡£±ØÐë±»SysTick_ISRÖÜÆÚÐÔµ÷ÓÃ¡£
*	ÐÎ    ²Î:  _tmr : ¶¨Ê±Æ÷±äÁ¿Ö¸Õë
*	·µ »Ø Öµ: ÎÞ
*********************************************************************************************************
*/
static void bsp_SoftTimerDec(SOFT_TMR *_tmr)
{
	if (_tmr->Count > 0)
	{
		/* Èç¹û¶¨Ê±Æ÷±äÁ¿¼õµ½1ÔòÉèÖÃ¶¨Ê±Æ÷µ½´ï±êÖ¾ */
		if (--_tmr->Count == 0)
		{
			_tmr->Flag = 1;

			/* Èç¹ûÊÇ×Ô¶¯Ä£Ê½£¬Ôò×Ô¶¯ÖØ×°¼ÆÊýÆ÷ */
			if(_tmr->Mode == TMR_AUTO_MODE)
			{
				_tmr->Count = _tmr->PreLoad;
			}
		}
	}
}

/*
*********************************************************************************************************
*	º¯ Êý Ãû: bsp_DelayMS
*	¹¦ÄÜËµÃ÷: ms¼¶ÑÓ³Ù£¬ÑÓ³Ù¾«¶ÈÎªÕý¸º1ms
*	ÐÎ    ²Î:  n : ÑÓ³Ù³¤¶È£¬µ¥Î»1 ms¡£ n Ó¦´óÓÚ2
*	·µ »Ø Öµ: ÎÞ
*********************************************************************************************************
*/
void bsp_DelayMS(uint32_t n)
{
	if (n == 0)
	{
		return;
	}
	else if (n == 1)
	{
		n = 2;
	}

	DISABLE_INT();  			/* ¹ØÖÐ¶Ï */

	s_uiDelayCount = n;
	s_ucTimeOutFlag = 0;

	ENABLE_INT();  				/* ¿ªÖÐ¶Ï */

	while (1)
	{
		//bsp_Idle();				/* CPU¿ÕÏÐÖ´ÐÐµÄ²Ù×÷£¬ ¼û bsp.c ºÍ bsp.h ÎÄ¼þ */

		/*
			µÈ´ýÑÓ³ÙÊ±¼äµ½
			×¢Òâ£º±àÒëÆ÷ÈÏÎª s_ucTimeOutFlag = 0£¬ËùÒÔ¿ÉÄÜÓÅ»¯´íÎó£¬Òò´Ë s_ucTimeOutFlag ±äÁ¿±ØÐëÉêÃ÷Îª volatile
		*/
		if (s_ucTimeOutFlag == 1)
		{
			break;
		}
	}
}

/*
*********************************************************************************************************
*    º¯ Êý Ãû: bsp_DelayUS
*    ¹¦ÄÜËµÃ÷: us¼¶ÑÓ³Ù¡£ ±ØÐëÔÚsystick¶¨Ê±Æ÷Æô¶¯ºó²ÅÄÜµ÷ÓÃ´Ëº¯Êý¡£
*    ÐÎ    ²Î:  n : ÑÓ³Ù³¤¶È£¬µ¥Î»1 us
*    ·µ »Ø Öµ: ÎÞ
*********************************************************************************************************
*/
void bsp_DelayUS(uint32_t n)
{
    uint32_t ticks;
    uint32_t told;
    uint32_t tnow;
    uint32_t tcnt = 0;
    uint32_t reload;

	reload = SysTick->LOAD;
    ticks = n * (SystemCoreClock / 1000000);	 /* ÐèÒªµÄ½ÚÅÄÊý */

    tcnt = 0;
    told = SysTick->VAL;             /* ¸Õ½øÈëÊ±µÄ¼ÆÊýÆ÷Öµ */

    while (1)
    {
        tnow = SysTick->VAL;
        if (tnow != told)
        {
            /* SYSTICKÊÇÒ»¸öµÝ¼õµÄ¼ÆÊýÆ÷ */
            if (tnow < told)
            {
                tcnt += told - tnow;
            }
            /* ÖØÐÂ×°ÔØµÝ¼õ */
            else
            {
                tcnt += reload - tnow + told;
            }
            told = tnow;

            /* Ê±¼ä³¬¹ý/µÈÓÚÒªÑÓ³ÙµÄÊ±¼ä,ÔòÍË³ö */
            if (tcnt >= ticks)
            {
            	break;
            }
        }
    }
}


/*
*********************************************************************************************************
*	º¯ Êý Ãû: bsp_StartTimer
*	¹¦ÄÜËµÃ÷: Æô¶¯Ò»¸ö¶¨Ê±Æ÷£¬²¢ÉèÖÃ¶¨Ê±ÖÜÆÚ¡£
*	ÐÎ    ²Î:  	_id     : ¶¨Ê±Æ÷ID£¬ÖµÓò¡¾0,TMR_COUNT-1¡¿¡£ÓÃ»§±ØÐë×ÔÐÐÎ¬»¤¶¨Ê±Æ÷ID£¬ÒÔ±ÜÃâ¶¨Ê±Æ÷ID³åÍ»¡£
*				_period : ¶¨Ê±ÖÜÆÚ£¬µ¥Î»1ms
*	·µ »Ø Öµ: ÎÞ
*********************************************************************************************************
*/
void bsp_StartTimer(uint8_t _id, uint32_t _period)
{
	if (_id >= TMR_COUNT)
	{
		/* ´òÓ¡³ö´íµÄÔ´´úÂëÎÄ¼þÃû¡¢º¯ÊýÃû³Æ */
		BSP_Printf("Error: file %s, function %s()\r\n", __FILE__, __FUNCTION__);
		while(1); /* ²ÎÊýÒì³££¬ËÀ»úµÈ´ý¿´ÃÅ¹·¸´Î» */
	}

	DISABLE_INT();  			/* ¹ØÖÐ¶Ï */

	s_tTmr[_id].Count = _period;		/* ÊµÊ±¼ÆÊýÆ÷³õÖµ */
	s_tTmr[_id].PreLoad = _period;		/* ¼ÆÊýÆ÷×Ô¶¯ÖØ×°Öµ£¬½ö×Ô¶¯Ä£Ê½Æð×÷ÓÃ */
	s_tTmr[_id].Flag = 0;				/* ¶¨Ê±Ê±¼äµ½±êÖ¾ */
	s_tTmr[_id].Mode = TMR_ONCE_MODE;	/* 1´ÎÐÔ¹¤×÷Ä£Ê½ */

	ENABLE_INT();  				/* ¿ªÖÐ¶Ï */
}

/*
*********************************************************************************************************
*	º¯ Êý Ãû: bsp_StartAutoTimer
*	¹¦ÄÜËµÃ÷: Æô¶¯Ò»¸ö×Ô¶¯¶¨Ê±Æ÷£¬²¢ÉèÖÃ¶¨Ê±ÖÜÆÚ¡£
*	ÐÎ    ²Î:  	_id     : ¶¨Ê±Æ÷ID£¬ÖµÓò¡¾0,TMR_COUNT-1¡¿¡£ÓÃ»§±ØÐë×ÔÐÐÎ¬»¤¶¨Ê±Æ÷ID£¬ÒÔ±ÜÃâ¶¨Ê±Æ÷ID³åÍ»¡£
*				_period : ¶¨Ê±ÖÜÆÚ£¬µ¥Î»10ms
*	·µ »Ø Öµ: ÎÞ
*********************************************************************************************************
*/
void bsp_StartAutoTimer(uint8_t _id, uint32_t _period)
{
	if (_id >= TMR_COUNT)
	{
		/* ´òÓ¡³ö´íµÄÔ´´úÂëÎÄ¼þÃû¡¢º¯ÊýÃû³Æ */
		BSP_Printf("Error: file %s, function %s()\r\n", __FILE__, __FUNCTION__);
		while(1); /* ²ÎÊýÒì³££¬ËÀ»úµÈ´ý¿´ÃÅ¹·¸´Î» */
	}

	DISABLE_INT();  		/* ¹ØÖÐ¶Ï */

	s_tTmr[_id].Count = _period;			/* ÊµÊ±¼ÆÊýÆ÷³õÖµ */
	s_tTmr[_id].PreLoad = _period;		/* ¼ÆÊýÆ÷×Ô¶¯ÖØ×°Öµ£¬½ö×Ô¶¯Ä£Ê½Æð×÷ÓÃ */
	s_tTmr[_id].Flag = 0;				/* ¶¨Ê±Ê±¼äµ½±êÖ¾ */
	s_tTmr[_id].Mode = TMR_AUTO_MODE;	/* ×Ô¶¯¹¤×÷Ä£Ê½ */

	ENABLE_INT();  			/* ¿ªÖÐ¶Ï */
}

/*
*********************************************************************************************************
*	º¯ Êý Ãû: bsp_StopTimer
*	¹¦ÄÜËµÃ÷: Í£Ö¹Ò»¸ö¶¨Ê±Æ÷
*	ÐÎ    ²Î:  	_id     : ¶¨Ê±Æ÷ID£¬ÖµÓò¡¾0,TMR_COUNT-1¡¿¡£ÓÃ»§±ØÐë×ÔÐÐÎ¬»¤¶¨Ê±Æ÷ID£¬ÒÔ±ÜÃâ¶¨Ê±Æ÷ID³åÍ»¡£
*	·µ »Ø Öµ: ÎÞ
*********************************************************************************************************
*/
void bsp_StopTimer(uint8_t _id)
{
	if (_id >= TMR_COUNT)
	{
		/* ´òÓ¡³ö´íµÄÔ´´úÂëÎÄ¼þÃû¡¢º¯ÊýÃû³Æ */
		BSP_Printf("Error: file %s, function %s()\r\n", __FILE__, __FUNCTION__);
		while(1); /* ²ÎÊýÒì³££¬ËÀ»úµÈ´ý¿´ÃÅ¹·¸´Î» */
	}

	DISABLE_INT();  	/* ¹ØÖÐ¶Ï */

	s_tTmr[_id].Count = 0;				/* ÊµÊ±¼ÆÊýÆ÷³õÖµ */
	s_tTmr[_id].Flag = 0;				/* ¶¨Ê±Ê±¼äµ½±êÖ¾ */
	s_tTmr[_id].Mode = TMR_ONCE_MODE;	/* ×Ô¶¯¹¤×÷Ä£Ê½ */

	ENABLE_INT();  		/* ¿ªÖÐ¶Ï */
}

/*
*********************************************************************************************************
*	º¯ Êý Ãû: bsp_CheckTimer
*	¹¦ÄÜËµÃ÷: ¼ì²â¶¨Ê±Æ÷ÊÇ·ñ³¬Ê±
*	ÐÎ    ²Î:  	_id     : ¶¨Ê±Æ÷ID£¬ÖµÓò¡¾0,TMR_COUNT-1¡¿¡£ÓÃ»§±ØÐë×ÔÐÐÎ¬»¤¶¨Ê±Æ÷ID£¬ÒÔ±ÜÃâ¶¨Ê±Æ÷ID³åÍ»¡£
*				_period : ¶¨Ê±ÖÜÆÚ£¬µ¥Î»1ms
*	·µ »Ø Öµ: ·µ»Ø 0 ±íÊ¾¶¨Ê±Î´µ½£¬ 1±íÊ¾¶¨Ê±µ½
*********************************************************************************************************
*/
uint8_t bsp_CheckTimer(uint8_t _id)
{
	if (_id >= TMR_COUNT)
	{
		return 0;
	}

	if (s_tTmr[_id].Flag == 1)
	{
		s_tTmr[_id].Flag = 0;
		return 1;
	}
	else
	{
		return 0;
	}
}

/*
*********************************************************************************************************
*	º¯ Êý Ãû: bsp_GetRunTime
*	¹¦ÄÜËµÃ÷: »ñÈ¡CPUÔËÐÐÊ±¼ä£¬µ¥Î»1ms¡£×î³¤¿ÉÒÔ±íÊ¾ 24.85Ìì£¬Èç¹ûÄãµÄ²úÆ·Á¬ÐøÔËÐÐÊ±¼ä³¬¹ýÕâ¸öÊý£¬Ôò±ØÐë¿¼ÂÇÒç³öÎÊÌâ
*	ÐÎ    ²Î:  ÎÞ
*	·µ »Ø Öµ: CPUÔËÐÐÊ±¼ä£¬µ¥Î»1ms
*********************************************************************************************************
*/
int32_t bsp_GetRunTime(void)
{
	int32_t runtime;

	DISABLE_INT();  	/* ¹ØÖÐ¶Ï */

	runtime = g_iRunTime;	/* Õâ¸ö±äÁ¿ÔÚSystickÖÐ¶ÏÖÐ±»¸ÄÐ´£¬Òò´ËÐèÒª¹ØÖÐ¶Ï½øÐÐ±£»¤ */

	ENABLE_INT();  		/* ¿ªÖÐ¶Ï */

	return runtime;
}

/*
*********************************************************************************************************
*	º¯ Êý Ãû: SysTick_Handler
*	¹¦ÄÜËµÃ÷: ÏµÍ³àÖàª¶¨Ê±Æ÷ÖÐ¶Ï·þÎñ³ÌÐò¡£Æô¶¯ÎÄ¼þÖÐÒýÓÃÁË¸Ãº¯Êý¡£
*	ÐÎ    ²Î:  ÎÞ
*	·µ »Ø Öµ: ÎÞ
*********************************************************************************************************
*/
//void SysTick_Handler(void)
//{
	//HAL_IncTick(); // Call HAL tick handler
	//SysTick_ISR();
//}












